[
  {
    "id": "9084986f-456c-449b-ae6e-59ef1f26b129",
    "title": "CSS in Depth",
    "author": "Keith J. Grant",
    "genre": "Web Development",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_zIgYlIxcY.png",
    "coverColor": "#1e2a4b",
    "description": "CSS in Depth by Keith J. Grant is a comprehensive guide for web developers who want to go beyond the basics of CSS and master the intricacies of styling web pages. The book is designed for intermediate to advanced developers who are already familiar with CSS but want to deepen their understanding and leverage its full potential.",
    "totalCopies": 18,
    "availableCopies": 16,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_O-O0Z_Vz5.png",
    "summary": "CSS in Depth starts by reviewing the basic principles of CSS, then quickly moves on to more advanced concepts."
  },
  {
    "id": "350c3bc8-a5cc-45a3-ba16-97b93ed056b0",
    "title": "HTML and CSS: Design and Build Websites",
    "author": "Jon Duckett",
    "genre": "Web Development",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_1pCoBDI11.png",
    "coverColor": "#3a2931",
    "description": "Whether you’re a complete beginner or someone looking to brush up on HTML and CSS, this book provides a solid foundation and practical skills that can be applied immediately to real-world projects.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_MONyhmpr4V.png",
    "summary": "HTML and CSS: Design and Build Websites starts with an introduction to HTML, covering the basic building blocks of a webpage, including elements like headings, paragraphs, links, and images."
  },
  {
    "id": "b514f922-a715-45ec-846e-e51d40e15aa2",
    "title": "System Design Interview",
    "author": "Alex Xu",
    "genre": "System Design",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_CmVaNeXrQ.png",
    "coverColor": "#363b63",
    "description": "System Design Interview: An Insider's Guide by Alex Xu is a must-read for software engineers and professionals preparing for system design interviews. The book provides a detailed overview of the principles and techniques needed to excel in system design interviews, which are often a key part of the hiring process at top tech companies.",
    "totalCopies": 10,
    "availableCopies": 10,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_x_vGP6M7Y.png",
    "summary": "System Design Interview: An Insider's Guide begins by introducing the key concepts of system design, emphasizing the importance of understanding requirements, scalability, and reliability."
  },
  {
    "id": "b4ed06bf-02b2-42c4-8886-b3847af02cca",
    "title": "Computer Science Distilled",
    "author": "Wladston Ferreira Filho",
    "genre": "Computer Science",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_ZRyGl0A75A.png",
    "coverColor": "#73d173",
    "description": "Computer Science Distilled by Wladston Ferreira Filho is a concise and approachable introduction to the core concepts of computer science. Designed for beginners and those looking to strengthen their problem-solving skills, the book breaks down complex topics into digestible, easy-to-understand pieces.",
    "totalCopies": 89,
    "availableCopies": 87,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_W6XGeHaEO.png",
    "summary": "Computer Science Distilled begins by explaining the art of problem-solving in computing, emphasizing the importance of breaking down problems into manageable parts."
  },
  {
    "id": "dc73abc1-8699-4e0a-91b0-a67e80292b9c",
    "title": "The Art of Assembly Language",
    "author": "Randall Hyde",
    "genre": "Programming",
    "rating": 3,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_lZrAopUNM.png",
    "coverColor": "#fff9bf",
    "description": "The Art of Assembly Language by Randall Hyde is a comprehensive and engaging introduction to assembly language programming. Known for its clarity and depth, the book provides readers with a solid foundation in low-level programming concepts, which are essential for understanding how computers operate at their core.",
    "totalCopies": 78,
    "availableCopies": 78,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_VGtFawJik.png",
    "summary": "The Art of Assembly Language introduces readers to the fundamentals of assembly programming, beginning with an overview of computer architecture."
  },
  {
    "id": "17a58b62-0258-45a5-8b8b-9a21a6d6630c",
    "title": "Seriously Good Software",
    "author": "Marco Faella",
    "genre": "Programming",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_YiFXdp5P_T.png",
    "coverColor": "#061e20",
    "description": "This book is perfect for developers who want to elevate their coding skills beyond functionality, making their work robust and professional. Written in an accessible style, Seriously Good Software bridges the gap between theoretical principles and practical application.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_LhwRi_a9cJ.png",
    "summary": "Seriously Good Software starts by exploring the core principles of software development, emphasizing the importance of correctness—software must function as intended under all specified conditions."
  },
  {
    "id": "91445e57-01a8-4e1e-bb18-cf04b3a0b7d1",
    "title": "Fundamentals of Database Systems",
    "author": "Ramez Elmasri and Shamkant B. Navathe",
    "genre": "Computer Science",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_9-sl0Jo8y.png",
    "coverColor": "#ffffff",
    "description": "Fundamentals of Database Systems by Ramez Elmasri and Shamkant B. Navathe is a comprehensive textbook that serves as a cornerstone for understanding database systems and their applications. This book is widely used in academia and the industry to teach and learn foundational and advanced database concepts.",
    "totalCopies": 145,
    "availableCopies": 145,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_UZULgWXVA.png",
    "summary": "Fundamentals of Database Systems begins by introducing the fundamental concepts of database systems, including their purpose, architecture, and role in modern computing."
  },
  {
    "id": "c3f2ff59-a3c2-47d2-a793-93457a9dccf7",
    "title": "Operating System Concepts",
    "author": "Abraham Silberschatz, Peter B. Galvin, and Greg Gagne",
    "genre": "Computer Science",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_W6Bz0KiBC.png",
    "coverColor": "#0e0e10",
    "description": "Operating System Concepts, often referred to as the \"Dinosaur Book,\" is a definitive guide to understanding the inner workings of operating systems. Written by Abraham Silberschatz, Peter B. Galvin, and Greg Gagne, this book is an essential resource for students, educators, and professionals in the field of computer science.",
    "totalCopies": 97,
    "availableCopies": 97,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_rkMFYr5J0.png",
    "summary": "Operating System Concepts provides an in-depth exploration of operating systems, starting with an introduction to their fundamental role in computing. It describes how operating systems manage hardware resources, such as the CPU, memory, and storage, to ensure efficient and reliable operation.\n\nThe book dives into critical topics, such as process and thread management, illustrating how multitasking and concurrency are achieved. It explains scheduling algorithms, synchronization techniques, and methods to handle deadlocks, providing a comprehensive understanding of process control.\n\nMemory management is another focus, with detailed discussions on paging, segmentation, and virtual memory. The book explains how these mechanisms optimize resource allocation while ensuring system stability. Similarly, the authors delve into file systems and storage structures, illustrating how data is stored, retrieved, and managed.\n\nAdvanced topics include security, protection, and distributed systems. Readers learn about authentication, access control, and methods to safeguard operating systems against potential threats. The book also introduces modern developments, such as virtualization and cloud computing, making it relevant in today's tech landscape.\n\nWith a balance of theory and practical application, Operating System Concepts equips readers with the knowledge needed to design, analyze, and optimize operating systems effectively."
  },
  {
    "id": "fe03e013-53b8-4574-9ca8-caec69a9b16c",
    "title": "Algorithms",
    "author": "Robert Sedgewick and Kevin Wayne",
    "genre": "Computer Science",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_dr-f_LPwA.png",
    "coverColor": "#bf1e2e",
    "description": "Algorithms by Robert Sedgewick and Kevin Wayne is a comprehensive and authoritative guide to understanding algorithms and their role in modern computing. Widely regarded as a foundational text in computer science, the book covers a vast array of algorithms, ranging from sorting and searching to graph processing and string manipulation.",
    "totalCopies": 321,
    "availableCopies": 318,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KSZGUHg5R.png",
    "summary": "Algorithms is a thorough exploration of algorithmic principles and their applications."
  },
  {
    "id": "585df184-991b-4edf-9902-f8531c3a81d9",
    "title": "The Clean Coder",
    "author": "Robert C. Martin",
    "genre": "Software",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_EE5klEyX0.png",
    "coverColor": "#060709",
    "description": "The Clean Coder by Robert C. Martin is an essential guide for software developers who aspire to reach the highest standards of professionalism. Written by one of the most respected figures in the software engineering community, this book transcends technical skills, focusing on the mindset, ethics, and practices that define a professional programmer.",
    "totalCopies": 35,
    "availableCopies": 35,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_50K9AmWND.png",
    "summary": "The Clean Coder delves into the principles and practices of professional software development."
  },
  {
    "id": "cea639ce-ee90-4ef9-9fef-c9562a247e99",
    "title": "The Lean Startup",
    "author": "Eric Ries",
    "genre": "Software",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_XyoNwHCdwe.png",
    "coverColor": "#1E73BE",
    "description": "The Lean Startup by Eric Ries is a guide to building and managing startups in a way that maximizes innovation while minimizing wasted effort. The book introduces the concept of the “Lean Startup” methodology, which focuses on quickly turning ideas into products, testing them with real customers, and learning from their feedback to refine and improve.",
    "totalCopies": 17,
    "availableCopies": 17,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_uiRdVQTTm.png",
    "summary": "The Lean Startup by Eric Ries is a guide to building and managing startups in a way that maximizes innovation while minimizing wasted effort."
  },
  {
    "id": "68f7c183-b995-4ba3-a644-30110ebb932e",
    "title": "Atomic Habits",
    "author": "James Clear",
    "genre": "Self Help",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_HOCexO5Ms.png",
    "coverColor": "#ffffff",
    "description": "Atomic Habits by James Clear is a book about how small changes in daily habits can lead to significant transformations over time. Clear emphasizes that habits are the compound interest of self-improvement—tiny actions repeated consistently will eventually produce remarkable results.",
    "totalCopies": 1200,
    "availableCopies": 1200,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_WyfBbHfTp.png",
    "summary": "Atomic Habits by James Clear is a book about how small changes in daily habits can lead to significant transformations over time."
  },
  {
    "id": "b6b9cc5d-95fd-488e-b1df-2a805678b430",
    "title": "React in Action",
    "author": "Mark Tielens Thomas",
    "genre": "Web Development",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_rzjr6TrKF.png",
    "coverColor": "#302428",
    "description": "React in Action by Mark Tielens Thomas is a practical guide to mastering React, a popular JavaScript library for building user interfaces. The book is ideal for developers looking to learn React from the ground up and for those seeking to deepen their understanding of its ecosystem.",
    "totalCopies": 57,
    "availableCopies": 57,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_jO3MUj8-s.png",
    "summary": "React in Action by Mark Tielens Thomas is a practical guide to mastering React, a popular JavaScript library for building user interfaces."
  },
  {
    "id": "8f45a8ad-e0e1-437e-8987-5bcbaca24bd9",
    "title": "JavaScript: The Good Parts",
    "author": "Douglas Crockford",
    "genre": "Programming",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_-xOn0_b32.png",
    "coverColor": "#00a199",
    "description": "JavaScript: The Good Parts by Douglas Crockford is a concise guide to understanding and using the best features of JavaScript while avoiding its pitfalls. This book is designed for developers who want to write clean, efficient, and reliable JavaScript code by focusing only on the language's strengths.",
    "totalCopies": 501,
    "availableCopies": 500,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KOYG_-R2J.png",
    "summary": "JavaScript: The Good Parts by Douglas Crockford is a concise guide to understanding and using the best features of JavaScript while avoiding its pitfalls."
  },
  {
    "id": "d125678e-80d7-4ba8-97a6-cc6ee4b980ef",
    "title": "Eloquent Javascript",
    "author": "Marijn Haverbeke",
    "genre": "Programming",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_acYPV3jV0.png",
    "coverColor": "#F8D347",
    "description": "Eloquent JavaScript by Marijn Haverbeke is a deep dive into JavaScript, designed for developers who want to master the language. The book combines clear explanations, practical examples, and exercises to help readers understand both the basics and advanced features of JavaScript.",
    "totalCopies": 121,
    "availableCopies": 120,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_l0umqa2H6.png",
    "summary": "Eloquent JavaScript by Marijn Haverbeke is a deep dive into JavaScript, designed for developers who want to master the language."
  },
  {
    "id": "383a8140-08b8-4c7c-97a7-e1bc68dc1488",
    "title": "Fullstack React: The Complete Guide to ReactJS and Friends",
    "author": "Accomazzo, Greif, and Murray",
    "genre": "Web Development",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_aiko1JtEn.png",
    "coverColor": "#eac8bf",
    "description": "Fullstack React: The Complete Guide to ReactJS and Friends by Accomazzo, Greif, and Murray is a comprehensive resource for developers who want to master React and build full-stack applications.",
    "totalCopies": 11,
    "availableCopies": 11,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_0HxM1wQe62.png",
    "summary": "Fullstack React: The Complete Guide to ReactJS and Friends by Accomazzo, Greif, and Murray is a comprehensive resource for developers who want to master React and build full-stack applications. "
  },
  {
    "id": "cc625b42-6852-44af-b3a3-e668fa967b8e",
    "title": "Cracking the Coding Interview",
    "author": "Gayle Laakmann McDowell",
    "genre": "Programming",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_yryJFVYWd.png",
    "coverColor": "#97cc02",
    "description": "Cracking the Coding Interview by Gayle Laakmann McDowell is a comprehensive guide for software engineers preparing for technical interviews. The book is packed with insights, strategies, and over 180 programming questions that simulate real interview scenarios.",
    "totalCopies": 32,
    "availableCopies": 32,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_vcXsdjkqw.png",
    "summary": "Cracking the Coding Interview by Gayle Laakmann McDowell is a comprehensive guide for software engineers preparing for technical interviews."
  }
]
